{
  "title": "Events",
  "upcoming": [
    {
      "title": "AI in Healthcare",
      "date": "2025-11-25",
      "description": "The first event under the AI+ series focusing on problem statements in medical AI. Participants work on detecting pneumonia from chest X-rays using deep learning techniques.",
      "image": "/src/assets/posters/ai_in_healthcare.jpg"
    },
    {
      "title": "Bioforge: The Biomimetics Challenge (Algodoo)",
      "date": "2025-12-10",
      "description": "KBG and Yantrik Club present BIOFORGE, a biomimetic design challenge using Algodoo. Teams design motile mechanisms inspired by biology to traverse obstacle courses under simulated constraints.",
      "image": "/src/assets/posters/bioforge_algodoo.jpg"
    },
    {
      "title": "Cell Saga 2.0",
      "date": "2025-12-20",
      "description": "A thrilling scavenger hunt that brings together logic, biology, and teamwork. Race against time to uncover clues and reach the final frontier in this fun-filled event.",
      "image": "/src/assets/posters/cell_saga2.jpg"
    },
    {
      "title": "Epidemic",
      "date": "2026-01-05",
      "description": "Step into the shoes of an epidemiologist. Model the spread of a virtual outbreak, analyze infection patterns, and develop intervention strategies to flatten the curve.",
      "image": "/src/assets/posters/epidemic.jpg"
    },
    {
      "title": "HIVE",
      "date": "2026-01-25",
      "description": "Inspired by swarm intelligence, HIVE challenges participants to explore collective algorithms and develop decentralized problem-solving models inspired by nature.",
      "image": "/src/assets/posters/hive.jpg"
    },
    {
      "title": "Pitch Terra",
      "date": "2026-02-15",
      "description": "Pitch Terra invites budding entrepreneurs to propose startups solving environmental problems through biotechnology and sustainability-driven innovation.",
      "image": "/src/assets/posters/pitch_terra.jpg"
    },
    {
      "title": "Talk: Angad Singh",
      "date": "2026-03-01",
      "description": "A student interaction session on how nature forms complex biological patterns via signalling pathways and clocks. Led by Mr. Chandel Angad Singh, exploring careers and research in biocomplexity.",
      "image": "/src/assets/posters/talk_angad.jpg"
    }
  ],
  "past": [
    {
      "title": "AI+PS2: Neuroheadstate – EyeState Classification",
      "date": "2025-09-25",
      "description": "Participants decoded EEG signals to classify human eye states, exploring neural signal processing and machine learning in neuroscience.",
      "image": "/src/assets/posters/neuroheadstate.jpg"
    },
    {
      "title": "AI × Bio",
      "date": "2025-08-10",
      "description": "An introductory session exploring the convergence of artificial intelligence and biology through interactive discussions and medical dataset prediction exercises.",
      "image": "/src/assets/posters/aixbio.jpg"
    },
    {
      "title": "Bio-Forge: The Biomimetics Challenge",
      "date": "2025-06-12",
      "description": "A competition combining engineering and biology where participants used Algodoo to simulate bio-inspired motion mechanisms.",
      "image": "/src/assets/posters/bioforge_past.jpg"
    },
    {
      "title": "Cell Saga",
      "date": "2025-04-05",
      "description": "A fast-paced scavenger hunt combining biology and logic. The first edition that set the stage for the Cell Saga series.",
      "image": "/src/assets/posters/cell_saga1.jpg"
    },
    {
      "title": "Genetics 101",
      "date": "2025-02-15",
      "description": "An introductory talk on genetic engineering, gene therapy, and ethical aspects of modern genetics.",
      "image": "/src/assets/posters/genetics101.jpg"
    },
    {
      "title": "Origin of Life",
      "date": "2024-12-10",
      "description": "A session exploring scientific theories about life’s beginnings, from the Big Bang to RNA world hypotheses.",
      "image": "/src/assets/posters/origin_of_life.jpg"
    },
    {
      "title": "Talk: iGEM",
      "date": "2024-10-20",
      "description": "A seminar introducing the international iGEM competition and the world of synthetic biology by Benjamin Schwetz.",
      "image": "/src/assets/posters/igem_talk.jpg"
    },
    {
      "title": "SynBio 101",
      "date": "2024-08-05",
      "description": "A hands-on iGEM-style competition where teams researched and pitched synthetic biology projects to a judging panel.",
      "image": "/src/assets/posters/synbio101.jpg"
    }
  ]
}
